src/Documents/ПоступлениеТоваровИУслуг/ПоступлениеТоваровИУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеТоваровИУслуг</name>
  <registerRecords>AccumulationRegister.УчетЗатрат</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыНаСкладах</registerRecords>
  <attributes>
    <name>ВходящийНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВходящаяДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>DefinedType.ФинансовыеДанные</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокГодности</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.ФинансовыеДанные</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ФинансовыеДанные</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Услуга</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяЗатрат</name>
      <type>
        <types>CatalogRef.СтатьиЗатрат</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.ФинансовыеДанные</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ФинансовыеДанные</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/УчетнаяПолитика/УчетнаяПолитика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчетнаяПолитика</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>СпособУчетаЗапасов</name>
    <type>
      <types>EnumRef.СпособыСписанияЗапасов</types>
    </type>
  </resources>
</mdclass:InformationRegister>

src/AccumulationRegisters/ТоварыНаСкладах/ТоварыНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыНаСкладах</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ФинансовыеДанные</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СрокГодности</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/AccumulationRegisters/УчетЗатрат/УчетЗатрат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>УчетЗатрат</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ФинансовыеДанные</types>
    </type>
  </resources>
  <dimensions>
    <name>СтатьяЗатрат</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/AccountingRegisters/Хозрасчетный/Хозрасчетный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>Хозрасчетный</name>
  <chartOfAccounts>ChartOfAccounts.Хозрасчетный</chartOfAccounts>
  <correspondence>true</correspondence>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ФинансовыеДанные</types>
    </type>
    <balance>true</balance>
  </resources>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:AccountingRegister>

src/Enums/СпособыСписанияЗапасов/СпособыСписанияЗапасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыСписанияЗапасов</name>
  <enumValues>
    <name>ПоСредней</name>
  </enumValues>
  <enumValues>
    <name>FEFO</name>
  </enumValues>
</mdclass:Enum>

src/ChartsOfAccounts/Хозрасчетный/Хозрасчетный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfAccounts>
  <name>Хозрасчетный</name>
  <extDimensionTypes>ChartOfCharacteristicTypes.ВидыСубконтоХозрасчетные</extDimensionTypes>
  <predefined>
    <items>
      <name>Материалы</name>
      <description>Материалы</description>
      <code>10</code>
    </items>
    <items>
      <name>Товары</name>
      <description>Товары</description>
      <code>41</code>
    </items>
    <items>
      <name>РасходыНаПродажу</name>
      <description>Расходы на продажу</description>
      <code>44</code>
    </items>
    <items>
      <name>Касса</name>
      <description>Касса</description>
      <code>50</code>
    </items>
    <items>
      <name>РасчетыСПоставщиками</name>
      <description>Расчет с поставщиками</description>
      <code>60</code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>РасчетыСПокупателями</name>
      <description>Расчеты с покупателями</description>
      <code>62</code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>РасчетыСПерсоналомПоОплатеТруда</name>
      <description>Расчеты с персоналом по оплате труда</description>
      <code>70</code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>РасчетыСПодотчетнымиЛицами</name>
      <description>Расчет с подотчетными лицами</description>
      <code>71</code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>Продажи</name>
      <description>Продажи</description>
      <code>90</code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>ПрочиеДоходыИРасходы</name>
      <description>Прочие доходы и расходы</description>
      <code>91</code>
      <accountType>ActivePassive</accountType>
    </items>
  </predefined>
</mdclass:ChartOfAccounts>

src/ChartsOfCharacteristicTypes/ВидыСубконтоХозрасчетные/ВидыСубконтоХозрасчетные.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>ВидыСубконтоХозрасчетные</name>
  <type>
    <types>CatalogRef.Номенклатура</types>
    <types>CatalogRef.СтатьиЗатрат</types>
    <types>CatalogRef.Контрагенты</types>
    <types>CatalogRef.Сотрудники</types>
    <types>CatalogRef.Кассы</types>
  </type>
  <predefined>
    <items>
      <name>Кассы</name>
      <description>Кассы</description>
      <code>000000001</code>
      <type>
        <types>CatalogRef.Кассы</types>
      </type>
    </items>
    <items>
      <name>Контрагенты</name>
      <description>Контрагенты</description>
      <code>000000002</code>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </items>
    <items>
      <name>Номенклатура</name>
      <description>Номенклатура</description>
      <code>000000003</code>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </items>
    <items>
      <name>Сотрудники</name>
      <description>Сотрудники</description>
      <code>000000004</code>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </items>
    <items>
      <name>СтатьиЗатрат</name>
      <description>Статьи затрат</description>
      <code>000000005</code>
      <type>
        <types>CatalogRef.СтатьиЗатрат</types>
      </type>
    </items>
  </predefined>
</mdclass:ChartOfCharacteristicTypes>

src/Documents/ПоступлениеТоваровИУслуг/ObjectModule.bsl
// Модуль объекта документа "ПоступлениеТоваровИУслуг".
// Содержит основную логику проведения документа: формирование движений
// по регистрам накопления "ТоварыНаСкладах", "УчетЗатрат" и бухгалтерскому
// регистру "Хозрасчетный" в зависимости от учётной политики.

// Главный обработчик проведения документа.
// Параметры:
//   Отказ – признак отказа от проведения.
//   Режим – режим проведения (оперативный/неоперативный).
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// 1. Определяем способ учёта запасов из регистра сведений "УчетнаяПолитика".
	// Получаем последнюю актуальную запись на дату документа.
	СтруктураУчетнаяПолитика = РегистрыСведений.УчетнаяПолитика.ПолучитьПоследнее(Дата);
	Если СтруктураУчетнаяПолитика.СпособУчетаЗапасов = Перечисления.СпособыСписанияЗапасов.FEFO Тогда
		ОтражатьСрокиГодности = Истина;
	Иначе
		ОтражатьСрокиГодности = Ложь;
	КонецЕсли;
	
	// 2. Включаем запись движений для используемых регистров.
	Движения.ТоварыНаСкладах.Записывать = Истина;
	Движения.УчетЗатрат.Записывать = Истина;
	Движения.Хозрасчетный.Записывать = Истина;
	
	// ========== 1. Обработка табличной части "Товары" ==========   
	Если Товары.Количество() <> 0 Тогда
		
		// Запрос к табличной части документа для группировки одноимённых товаров
		// (с одинаковым сроком годности и счётом бухучёта), чтобы свернуть их в одно движение.
		ЗапросТовары = Новый Запрос;
		ЗапросТовары.УстановитьПараметр("Ссылка", Ссылка);
		ЗапросТовары.Текст = 
		"ВЫБРАТЬ
		|    ПоступлениеТовары.Номенклатура КАК Номенклатура,
		|    СУММА(ПоступлениеТовары.Количество) КАК Количество,
		|    СУММА(ПоступлениеТовары.Сумма) КАК Сумма,
		|    ПоступлениеТовары.СрокГодности КАК СрокГодности,
		|    ПоступлениеТовары.Номенклатура.СчетБухгалтерскогоУчета КАК СчетБухгалтерскогоУчета
		|ИЗ
		|    Документ.ПоступлениеТоваровИУслуг.Товары КАК ПоступлениеТовары
		|ГДЕ
		|    ПоступлениеТовары.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|    ПоступлениеТовары.Номенклатура,
		|    ПоступлениеТовары.СрокГодности,
		|    ПоступлениеТовары.Номенклатура.СчетБухгалтерскогоУчета";
		
		ВыборкаТовары = ЗапросТовары.Выполнить().Выбрать();
		Пока ВыборкаТовары.Следующий() Цикл
			// Движение прихода на склад.
			Движение = Движения.ТоварыНаСкладах.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Номенклатура = ВыборкаТовары.Номенклатура;
			Движение.Склад = Склад;
			Движение.Количество = ВыборкаТовары.Количество;
			Движение.Сумма = ВыборкаТовары.Сумма;
			// Если учётная политика FEFO, заполняем срок годности и формируем бухгалтерские проводки.
			Если ОтражатьСрокиГодности Тогда
				Движение.СрокГодности = ВыборкаТовары.СрокГодности; 
			КонецЕсли;
			
			// Бухгалтерская проводка: Дт СчетУчетаТовара Кт 60.01 (РасчетыСПоставщиками).
			Движение = Движения.Хозрасчетный.Добавить();
			Движение.СчетДт = ВыборкаТовары.СчетБухгалтерскогоУчета;
			Движение.СчетКт = ПланыСчетов.Хозрасчетный.РасчетыСПоставщиками;
			Движение.Период = Дата;
			Движение.Сумма = ВыборкаТовары.Сумма;
			Движение.Содержание = "Отражено поступление товарно-материальных ценностей от поставщика";
			// Заполняем аналитику: на дебет – номенклатура, на кредит – контрагент.
			Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура] = ВыборкаТовары.Номенклатура;
			Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты] = Контрагент;
		КонецЦикла; 
	КонецЕсли;
	
	// ========== 2. Обработка табличной части "Услуги" ==========  
	Если Услуги.Количество() <> 0 Тогда
		
		// Запрос к табличной части услуг с группировкой по статье затрат.
		// Используются ИТОГИ для иерархического обхода.
		ЗапросУслуги = Новый Запрос;
		ЗапросУслуги.УстановитьПараметр("Ссылка", Ссылка);
		ЗапросУслуги.Текст = 
		"ВЫБРАТЬ
		|    ПоступлениеУслуги.СтатьяЗатрат КАК СтатьяЗатрат,
		|    СУММА(ПоступлениеУслуги.Сумма) КАК Сумма,
		|    ПоступлениеУслуги.Услуга.СчетБухгалтерскогоУчета КАК СчетБухгалтерскогоУчета
		|ИЗ
		|    Документ.ПоступлениеТоваровИУслуг.Услуги КАК ПоступлениеУслуги
		|ГДЕ
		|    ПоступлениеУслуги.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|    ПоступлениеУслуги.СтатьяЗатрат,
		|    ПоступлениеУслуги.Услуга.СчетБухгалтерскогоУчета
		|ИТОГИ
		|    СУММА(Сумма)
		|ПО
		|    СтатьяЗатрат";
		
		// Обход с группировками: сначала внешний цикл по статьям затрат, затем вложенный – по детальным записям.
		ВыборкаУслуги = ЗапросУслуги.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
		Пока ВыборкаУслуги.Следующий() Цикл
			// Движение в регистр "УчетЗатрат" – общая сумма по статье.
			Движение = Движения.УчетЗатрат.Добавить();
			ЗаполнитьЗначенияСвойств(Движение,ВыборкаУслуги);
			Движение.Период = Дата;
			Движение.СтатьяЗатрат = ВыборкаУслуги.СтатьяЗатрат;
			
			// Вложенный обход – детальные записи по услугам для формирования проводок.
			ВыборкаДетальныеЗаписи = ВыборкаУслуги.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				// Бухгалтерская проводка: Дт СчетУчетаУслуги Кт 60.01.
				Движение = Движения.Хозрасчетный.Добавить();
				Движение.СчетДт = ВыборкаДетальныеЗаписи.СчетБухгалтерскогоУчета;
				Движение.СчетКт = ПланыСчетов.Хозрасчетный.РасчетыСПоставщиками;
				Движение.Период = Дата;
				Движение.Сумма = ВыборкаДетальныеЗаписи.Сумма;
				Движение.Содержание = "Отражено поступление услуг от поставщика";
				// Заполняем субконто с помощью процедуры из общего модуля.
				БухгалтерскийУчет.ЗаполнитьСубконтоПоСчету(Движение.СчетДт, Движение.СубконтоДт, ВыборкаДетальныеЗаписи.СтатьяЗатрат);
				БухгалтерскийУчет.ЗаполнитьСубконтоПоСчету(Движение.СчетКт, Движение.СубконтоКт, Контрагент); 
			КонецЦикла;  
		КонецЦикла;        
	КонецЕсли;
	
КонецПроцедуры
